{
  "3.1": "Example Question 1: \"A program is being developed that allows users to rate and review movies. A user will enter their rating (out of 10) and a written review for each movie they have watched. Computational thinking skills are used during the development of the program. A user will be able to register, log in and log out of the program. When registering, a new user will enter their details, before confirming their email address.\"\n\nMark Scheme for Q1:\n2 marks for AO2 (apply) Confirm / enter email address; Log out; A. any wording with the same meaning [2]\n\nExample Question 2: \"Decomposition has been used to break the problem down into smaller sub-problems. The chart below represents the design of the program. Complete the decomposition of this program by stating what should be written in boxes  and . (Total 2 marks) Page 1 of 127Calday Grange Grammar School The figure below shows an algorithm represented using pseudo-code. •   Line numbers are included but are not part of the algorithm. 1     names ← ['Lily', 'Thomas'] 2     name1 ← 'Sarah' 3     name2 ← 'Freddie' 4     OUTPUT name1[0] 5     OUTPUT LEN(names) 6     var ← SUBSTRING(0, 3, name1) 7     OUTPUT var SUBSTRING returns part of a string. For example, SUBSTRING(3, 5, 'programming') will return the string 'gra'.\"\n\nMark Scheme for Q2:\n(a)  Mark is for AO2 (apply) D  S; R. If more than one lozenge shaded 1",
  "3.2": "Example Question 1: \"(a)  Shade one lozenge that shows the line number where selection is first used in the algorithm in Figure 1. ALine number 1 BLine number 2 CLine number 3 DLine number 4 (1) (b)  Shade one lozenge that shows the output from the algorithm in Figure 1 when the user input is 4 A0 B2 C4 D8 E16 (1) Page 1 of 50Calday Grange Grammar School (c)  Shade one lozenge that shows the line number where assignment is first used in the algorithm in Figure 1. ALine number 1 BLine number 2 CLine number 3 DLine number 4 (1) (d)  Shade one lozenge that shows the line number that contains a relational operator in the algorithm in Figure 1. ALine number 1 BLine number 2 CLine number 3 DLine number 4 (1) Figure 1 has been included again below. Figure 1 1     i ← USERINPUT 2     IF i MOD 2 = 0 THEN 3       OUTPUT i * i 4     ELSE 5       OUTPUT i 6     ENDIF (e)  Shade one lozenge to show which of the following is a true statement about the algorithm in Figure 1. AThis algorithm uses a Boolean operator. BThis algorithm uses a named constant. CThis algorithm uses iteration. DThis algorithm uses the multiplication operator. (1) Page 2 of 50Calday Grange Grammar School (f)  Figure 2 shows an implementation of the algorithm in Figure 1 using the Python programming language. •   Line numbers are included but are not part of the program. Figure 2 1     i = int(input(\"Enter a number: \")) 2     if i % 2 == 0: 3       print(i * i) 4     else: 5       print(i) The program in Figure 2 needs to be changed so that it repeats five times using definite (count controlled) iteration. Shade one lozenge next to the program that does this correctly. A for x in range(0, 5): i = int(input(\"Enter a number: \")) if i % 2 == 0: print(i * i) else: print(i) B for x in range(0, 6): i = int(input(\"Enter a number: \")) if i % 2 == 0: print(i * i) else: print(i) C x = 1 while x != 6: i = int(input(\"Enter a number: \")) if i % 2 == 0: print(i * i) else: print(i) x = x + 1 D x = 6 while x != 0: i = int(input(\"Enter a number: \")) if i % 2 == 0: print(i * i) else: print(i) x = x – 1 (1) (Total 6 marks) Page 3 of 50Calday Grange Grammar School The figure below shows a Python program that calculates car park charges. The user inputs their car registration (eg MA19 GHJ) and the length of the stay. The program then outputs the charge. •   Line numbers are included but are not part of the program. 1     charge = 0 2     carReg = input(\"Enter your car registration: \") 3     while len(carReg) > 8: 4       displayMessage = \" is not valid\" 5       carReg = input(displayMessage) 6     hours = int(input(\"Enter your stay in hours: \")) 7     if hours < 2: 8       charge = 0 9     else: 10      charge = hours * 2 11    print(charge)\"\n\nMark Scheme for Q1:\n(b)  Mark is for AO2 (apply) E   16; R. If more than one lozenge shaded 1 (c)  Mark is for AO2 (apply) A Line number 1; R. If more than one lozenge shaded 1 (d)  Mark is for AO2 (apply) B Line number 2; R. If more than one lozenge shaded 1 (e)  Mark is for AO2 (apply) D This algorithm uses the multiplication operator; R. If more than one lozenge shaded 1 (f)  Mark is for AO3 (refine) C# A for (int x = 0; x < 5; x++) { Console.Write(\"Enter a number: \"); int i = = Convert.ToInt32(Console.ReadLine()); if (i % 2 == 0) { Console.WriteLine(i * i); } else { Console.WriteLine(i); } } Page 30 of 50Calday Grange Grammar School Python A for x in range(0, 5): i = int(input(\"Enter a number: \")) if i % 2 == 0: print(i * i) else: print(i) VB.NET C For x As Integer = 0 To 4 Console.Write(\"Enter a number: \") Dim i As Integer = Console.ReadLine() If i Mod 2 = 0 Then Console.WriteLine(i * i); Else { Console.WriteLine(i) End If Next R. If more than one lozenge shaded 1 [6] (a)  Mark is for AO3 (refine) C# string displayMessage = carReg + \" is not valid\"; Python displayMessage = carReg + \" is not valid\" VB.NET Dim displayMessage As String = carReg + \" is not valid\" // Dim displayMessage As String = carReg & \" is not valid\" I. Case I. Space between variable outputs I. Order of strings 1\n\nExample Question 2: \"(a)  Rewrite line 4 in the figure above to concatenate the car registration with the string \" is not valid\", and store the result in the variable displayMessage. Your answer must be written in Python. (1) (b)  The charge for parking for two or more hours is changed to include an additional £2 fee. Rewrite line 10 in the figure above to show this change. Your answer must be written in Python. (1) (Total 2 marks) Page 4 of 50Calday Grange Grammar School The two Python programs in the figure below output the value that is equivalent to adding together the integers between 1 and an integer entered by the user. For example, if the user entered the integer 5, both programs would output 15 Program A print(\"Enter a number: \") num = int(input()) total = 0 for i in range(1, num + 1): total = total + i print(total) Program B print(\"Enter a number: \") num1 = int(input()) num2 = num1 + 1 num2 = num1 * num2 num2 = num2 // 2 print(num2)\"\n\nMark Scheme for Q2:\nPage 31 of 50Calday Grange Grammar School (b)  Mark is for AO3 (refine) C# charge = hours * 2 + 2; // charge = 2 + hours * 2; Python charge = hours * 2 + 2 // charge = 2 + hours * 2 VB.NET charge = hours * 2 + 2 // charge = 2 + hours * 2 I. Case I. Parentheses, unless altering result eg, hours * (2 + 2) 1 [2] (a)  Mark is for AO2 (apply) C Program B is more efficient than Program A; R. If more than one lozenge shaded 1",
  "3.3": "Example Question 1: \"Convert the binary number 10111001 into hexadecimal. You should show your working. (Total 2 marks)\"\n\nMark Scheme for Q1:\nMultiplying the correct 3 values together (44 000 * 30 * 8 = 10,560,000 bits) even if the result is incorrect;\n\nExample Question 2: \"State the largest decimal number that can be represented using 6 bits. (Total 1 mark)\"\n\nMark Scheme for Q2:\nDividing the result of a multiplication by 8 (even if the result is incorrect);",
  "3.4": "Example Question 1: \"(b)  A game uses three sensors. A red light (R) in the game switches on if all of the following conditions are true: •   sensor D is off •   sensor L is on •   sensor W is on. Complete the logic circuit for this game. You must use the correct symbols for the logic gates. (3) Page 1 of 53Calday Grange Grammar School (c)  Another circuit in the game will output True if any two sensors are activated or if all three sensors are activated. This has been represented as the Boolean expression: (W . D) + (D . L) . (W . L) The expression contains an error. Shade one lozenge that shows the expression with the error corrected. A (W . D) . (D . L) . (W . L) B ( . D) . (D . L) + (W . L) C (W . D) + (D . L) + (W . L) D ( . D) + (D + L) . (W . L) (1) (d)  A green light (G) in the game switches on if all of the following conditions are true: •   sensor D is off •   sensor L is off •   sensor W is on. Write a Boolean expression for this logic circuit. You must use Boolean expression operators in your answer. (3) (Total 8 marks) Describe what is meant by the terms system software and application software. (Total 2 marks)\"\n\nMark Scheme for Q1:\n6 GHz CPU •     Lower clock speed than B. •     Would process fewer instructions per second than B if it had the same number of cores. •     Combined with the quad core processor this equates to raw power of 6.4 billion instruction per sec – theoretically worse than B. •     Slower processor so more energy efficient.\n\nExample Question 2: \"State four functions of an operating system. (Total 4 marks)\"\n\nMark Scheme for Q2:\n4 marks for AO1 (recall) Maximum of four marks from: •   Processor / task / process management; •   Memory management; •   I/O device management; A. Peripheral Management (for this year only) •   Applications management; •   Security management; •   File / storage management; •   Network management; A. Provides a user interface [4]",
  "3.5": "Example Question 1: \"Computer networks can be installed using wired or wireless technology. Describe two differences between a Local Area Network (LAN) and a Wide Area Network (WAN). (Total 2 marks)\"\n\nMark Scheme for Q1:\n2 marks for AO1 (understanding) Maximum of two marks from: •   LANs cover relatively small geographical areas // WANs usually cover a wide geographic area; •   LANs often owned and controlled/managed by a single person/organisation // WANs often under collective/distributed ownership; •   WANs are (usually) several LANs connected together; •   WANs (usually) have a much larger number of devices/users than LANs; •   LAN has a lower latency // WAN has higher latency; •   WANs are (usually) slower than LANs; •   the cost-per-byte for transmission is much higher on a WAN; •   LANs and WANs use different protocols; [2]\n\nExample Question 2: \"Computer networks can be installed using wired or wireless technology. Give three advantages of using a wireless network instead of a wired network. (Total 3 marks)\"\n\nMark Scheme for Q2:\n3 marks for AO1 (understanding) Maximum of three marks from: •   flexibility to expand network/add users/add own devices to the network; •   there is no need to drill holes/install cabling; •   mobility of user/devices; •   modern devices are more likely to (be designed to) connect wirelessly; •   guest access; •   no trip hazards; A. cost if valid explanation given [3]",
  "3.6": "Example Question 1: \"Describe one security measure that could be used, in addition to a password, to make sure that a user is who they are claiming to be. (Total 2 marks)\"\n\nMark Scheme for Q1:\n2 marks for AO1 (understanding) 1 mark for the method and 1 mark for a valid expansion. •   A code can be sent to your phone as a (text) message/in an email/as a pop-up to one of your devices; the user then types in the code (as well as the password); any hacker would need to access the phone as well as the password; •   An authenticator app on a mobile phone; this generates a code which the user uses to complete the log-in; •   Use two-factor authentication/2FA // strong customer/multi-factor authentication; this asks for a second form of identification such as something you know/ possess/are; •   Biometrics; (to be authenticated) reference data is compared to the individual’s (unique) biometric data; •   Smart cards/fobs; the user inserts a Smart Card to a reader and enters the PIN, the authentication request is then verified (using digital certificates); •   Ask security / memorable question; the user is asked a question that only they know the answer to; [2]\n\nExample Question 2: \"State two reasons why automatic software updates provide better security than manual software updates. (Total 2 marks)\"\n\nMark Scheme for Q2:\n2 marks for AO1 (understanding) Maximum of two marks from: •   A user may forget to do updates manually; •   Automatic updates mean that a computer is protected more quickly; •   Automatic updates from a trusted / known (secure) source will be safe // manual updates may be from an infected source; [2]",
  "3.7": "Example Question 1: \"(a)  Define the term relationaldatabase. (2) (b)  State one benefit of using relational databases. (1) (c)  State the name of the field from the Member table that is the most suitable to use as the primary key. (1) (d)  State the name of the field from the Award table that is a foreign key. (1) Page 1 of 8Calday Grange Grammar School The figure above has been included again below. Member MemberIDFirstNameLastNameDateJoined 1ZarahTariq2020-01-05 2PennyHill2020-01-05 3PeterBoyes2020-02-14 4ReubenBailey2020-10-20 Award AwardIDMemberIDDatePresentedAwardName 112020-09-10Teamwork 212020-10-13Outdoors 332020-06-19Challenge 422020-11-11Leader (e)  The youth club needs to produce a report listing the members who have been given the Leader award. The report must include both names of each member and the date the award was presented. Write an SQL query that could be used to find this information. The results must be in order of the date the awards were presented, starting with the earliest. (6) (f)  A new member joins the youth club. The following SQL is run to add their details to the database: INSERT INTO (5, 'Alina', 'Ahmed', '2020-11-30') Some of the SQL has been replaced by labels. State the SQL that should have been written in place of the labels  and . (2) (Total 13 marks) Page 2 of 8Calday Grange Grammar School A relational database is being developed to store information about the games that are available to play at a games café and the advance bookings that have been made for those games. Each game has a unique name. The database contains two tables: Game and Booking. The database is currently being tested by the person who has developed it so the database tables only contain a small amount of data that is being used for testing. The contents of the tables are shown below.\"\n\nMark Scheme for Q1:\n(b)  Mark is for AO1 (understanding) Maximum of one mark from: Reduces data redundancy; Reduces data inconsistency; 1 (c)  Mark is for AO2 (apply) MemberID; I. case R. if quotation marks around response R. if obvious space(s) in response 1 (d)  Mark is for AO2 (apply) MemberID; I. case R. if quotation marks around response R. if obvious space(s) in response 1 Page 5 of 8Calday Grange Grammar School (e)  6 marks for AO3 (program) Maximum of five marks if any errors 1 mark: Three correct fields in SELECT clause; 1 mark: one correct table in FROM clause; 1 mark: second correct table in FROM clause; 1 mark: a correct condition in WHERE clause; 1 mark: correct conditions and correct usage of AND in WHERE clause // correct conditions and correct usage of ON with INNER JOIN; 1 mark: a correct ORDER BY clause; DPT. use of incorrect key words when their versions are meaningful in the context of the question, eg GET instead of SELECT or use of AND instead of commas in FROM clause. DPT. incorrect spelling of field names. A. Table names in front of field names provided the table names are correct A. == in place of = (for this year only) I. missing ASC in ORDER BY clause I. case and spacing R. missing quotes around ‘Leader’ Sample answer 1 SELECT FirstName, LastName, DatePresented FROM Member, Award WHERE Member.MemberID = Award.MemberID AND AwardName = 'Leader' ORDER BY DatePresented ASC Sample answer 2 SELECT FirstName, LastName, DatePresented FROM Member, Award WHERE Member.MemberID = Award.MemberID AND AwardID = 4 ORDER BY DatePresented ASC Sample answer 3 SELECT FirstName, LastName, DatePresented FROM Member INNER JOIN Award ON Member.MemberID = Award.MemberID WHERE AwardName = 'Leader' ORDER BY DatePresented ASC Sample answer 4 SELECT FirstName, LastName, DatePresented FROM Member INNER JOIN Award ON Member.MemberID = Award.MemberID WHERE AwardID = 4 ORDER BY DatePresented ASC 6 Page 6 of 8Calday Grange Grammar School (f)  2 marks for AO3 (program) Member;A. correct bracketed list of field identifiers after Member VALUES; I. case R. plural of Member R. singular of VALUES 2 [13] (a)  1 mark for AO2 (apply) Name; 1\n\nExample Question 2: \"Game NameMinPlayersMaxPlayersLengthOfGameComplexity Friday11252.12 Scythe15903.37 Terra Mystica251003.95 Agricola14903.31 Pandemic24452.42 Booking GameTableIDNameDateStartTimeCustomerHours 1Friday28/05/1911Hawkins1 2Scythe28/05/1911Jemisin1 3Pandemic28/05/1915Gormally1 1Pandemic28/05/1913Van Perlo2 1Terra Mystica29/05/1915Hawkins2 (a)  State the field in the Booking table that is a foreign key. (1) (b)  State the most suitable data type to use for the Complexity field. (1) (Total 2 marks) Page 3 of 8Calday Grange Grammar School Due to a change in layout at a games café, the game table with an ID of 2 is no longer suitable for games that can have more than four players. The manager needs to find out the customer, date and time of all bookings made for the game table with an ID of 2 that are for a game that can have more than four players. Write an SQL query that could be used to find this information for the manager. The results should be shown in date order. (Total 6 marks)\"\n\nMark Scheme for Q2:\n(b)  1 mark for AO2 (apply) Real // Float // Decimal; 1 [2] 6 marks for AO3 (program) 1 mark: correct fields in SELECT clause 1 mark: one correct table in FROM clause 1 mark: second correct table in FROM clause 1 mark: a correct condition in WHERE clause 1 mark: correct conditions and correct usage of AND in WHERE clause // correct conditions and correct usage of AND in WHERE clause and correct usage of ON with INNER JOIN 1 mark: ORDER BY clause",
  "3.8": "Example Question 1: \"Several companies produce microchips that can be implanted in humans. Thousands of people around the world have voluntarily had these microchips implanted in their hands. These tiny microchips are the size of a grain of rice. They can be a form of identification and can store a range of personal data. Describe how human microchip implants might be used when travelling or visiting places away from home. In your answer you should include: •   potential uses •   advantages to the person who has the implant •   legal and ethical considerations of human chip implants. (Total 6 marks)\"\n\nMark Scheme for Q1:\nGuidance: Ethical impacts •   Trust. The driver is trusting the algorithms in the car to make the correct decisions whilst driving eg slowing down when pedestrians are in the road. •   Decision making. The car must make human-like decisions when confronted with unusual circumstances eg the 'trolley problem’. •   Safer driving. Autonomous vehicles could be safer drivers than human drivers eg by keeping a safe distance from the car in front at all times. •   Data collection. Autonomous vehicles may collect private data about their passengers such as locations visited. Passengers may want to keep their journeys private. •   Job opportunities. Fewer roles needed for some professions such as taxi drivers but other opportunities could be created. •   Accessibility. Disabled passengers will not have to operate traditional car controls. Legal impacts •   Liability. There is a grey area about who is at fault (the manufacturer or the driver) in case of an accident. •   Insurance. The need for driving insurance will change as drivers are no longer responsible for the control of the car. •   Data protection. Car manufacturers must keep driving data secure in accordance with data protection laws. •   Security. Autonomous vehicles could be vulnerable to being hacked and hijacked for criminal purposes. •   Law updates. Driving laws will need to be amended to account for new types of vehicles on the roads. [6] Page 4 of 12Calday Grange Grammar School 6 marks for AO2 (apply) LevelDescriptionMark Range 3A range of uses, advantages legal and/or ethical considerations has been accurately described. The descriptions are in the context of travel. 5-6 2Statements have been made about uses, advantages and legal and/or ethical considerations. There is a brief description of some which may contain inaccuracies. The statements are in the context of travel. 3-4 1Some statements have been made about one or more of potential uses, advantages, legal and/or ethical considerations. These may not be accurate or correct. Some of the statements are in the context of travel. 1-2 0No creditworthy material0\n\nExample Question 2: \"Explain one data privacy concern an organisation would need to consider when setting up a wireless network. (Total 2 marks)\"\n\nMark Scheme for Q2:\nIndicative content Uses: •   near-field communication (NFC) payments for tickets can be made •   easy personal identification (without physical ID) when picking up pre-booked tickets •   enables secure access to systems / devices (eg a rental car) •   enables others access to your medical information if difficulties occur when you are travelling / if language is a barrier •   crossing borders without passport. Advantages: •   you’ll not need a wallet / cash •   don’t have to carry multiple cards •   may contain health data for emergency use. Legal and ethical considerations: •   may pose a risk of greater surveillance (by government / employers) •   may be exploited by criminals •   privacy of (and amount of) stored data and consent for use. [6] Page 5 of 12Calday Grange Grammar School 2 marks for AO1 (understanding) 1 mark for any of the following concerns and 1 mark for relevant expansion: •   spoofing or session hijacking; where the attacker assumes the identity of an authorised user; •   eavesdropping; all network data is broadcast and can be intercepted by third party; •   encrypting data; making sure that data is not transmitted in plain text; by ensuring that routers have encryption turned on; •   malware infiltration; a Wi-Fi network is more exposed to attack because it’s visible; •   malicious hotspots; unofficial access points that look like they are part of the network; [2]"
}